Revit 2027 API
ElectricalSystem.AddToCircuit Method
Add a set of exist components to the Electrical System.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool AddToCircuit(
	ElementSet components
)
Public Function AddToCircuit (
	components As ElementSet
) As Boolean
public:
bool AddToCircuit(
	ElementSet^ components
)
member AddToCircuit :
        components : ElementSet -> bool
Parameters
components ElementSet
The components added to the electrical system.
Return Value
Boolean
If successful, all the components will add to the system. Otherwise null is returned.
Remarks
This method will only function with the Autodesk Revit MEP application.
See Also
Reference
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace